[
    {
        "title":"WebGL",
        "description":"кроссплатформенный API для 3D-графики в браузере, разрабатываемый некоммерческой организацией Khronos Group. WebGL использует язык программирования шейдеров GLSL. WebGL исполняется как элемент HTML5 и поэтому является полноценной частью объектной модели документа браузера.",
        "url":"https://developer.mozilla.org/ru/docs/Web/API/WebGL_API"
    },
    {
        "title":"No-code",
        "description":"это метод с пользовательским опытом, который максимально похож на low-code, но при этом он позволяет даже бизнес-пользователям, которые не являются техническими специалистами, разрабатывать приложения, не написав при этом ни одной строки кода.",
        "url":"https://www.sap.com/cis/insights/what-is-low-code-no-code.html"
    },
    {
        "title":"Трёхмерная графика",
        "description":"раздел компьютерной графики, посвящённый методам создания изображений или видео путём моделирования объектов в трёх измерениях.",
        "url":"http://www.e-biblio.ru/book/bib/design/3d_graphics/3D.html"
    },
    {
        "title":"JavaScript",
        "description":"мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript.",
        "url":"https://www.javascript.com"
    },
    {
        "title":"Three.js",
        "description":"легковесная кроссбраузерная библиотека JavaScript, используемая для создания и отображения анимированной компьютерной 3D графики при разработке веб-приложений.",
        "url":"https://threejs.org"
    },
    {
        "title":"Babylon.js",
        "description":"легковесный кроссбраузерный JavaScript-фреймворк, использующий API WebGL для отображения 2D и 3D-графики в браузере без использования каких-либо сторонних плагинов и дополнений.",
        "url":"https://www.babylonjs.com"
    },
    {
        "title":"Application programming interface",
        "description":"описание способов взаимодействия одной компьютерной программы с другими. Обычно входит в описание какого-либо интернет-протокола, программного каркаса (фреймворка) или стандарта вызовов функций операционной системы.",
        "url":"https://aws.amazon.com/ru/what-is/api/"
    },
    {
        "title":"Рендеринг",
        "description":"термин в компьютерной графике, обозначающий процесс получения изображения по модели с помощью компьютерной программы.",
        "url":"https://coremission.net/gamedev/chto-takoe-rendering/"
    },
    {
        "title":"Docker",
        "description":"это проект с открытым исходным кодом для автоматизации развертывания приложений в виде переносимых автономных контейнеров, выполняемых в облаке или локальной среде.",
        "url":"https://www.docker.com"
    },
    {
        "title":"Back-end",
        "description":"Программно-аппаратная часть сервиса. Это набор средств, с помощью которых происходит реализация логики веб-сайта. Это то, что скрыто от наших глаз, т. е. происходит вне компьютера и браузера.",
        "url":"https://otus.ru/nest/post/943/"
    },
    {
        "title":"Front-end",
        "description":"практика преобразования данных в графический интерфейс с использованием HTML, CSS и JavaScript, чтобы пользователи могли просматривать эти данные и взаимодействовать с ними.",
        "url":"https://otus.ru/nest/post/943/"
    },
    {
        "title":"Python",
        "description":"Язык программирования, который широко используется в интернет-приложениях, разработке программного обеспечения, науке о данных и машинном обучении (ML). Разработчики используют Python, потому что он эффективен, прост в изучении и работает на разных платформах.",
        "url":"https://www.python.org"
    },
    {
        "title":"Selenium",
        "description":"это портативный фреймворк, который многие компании сегодня используют для тестирования веб-приложений. Он предоставляет инструментарий для написания функциональных тестов.",
        "url":"https://www.selenium.dev"
    },
    {
        "title":"3D Веб-контент",
        "description":"использующийся на веб-страницах контент, предусматривающий применение инструментов построения трехмерной графики",
        "url":"https://habr.com/ru/post/149025/"
    }
]